; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	infrared4 - mode
	thermograph2 - mode
	infrared3 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star3 - direction
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Planet21 - direction
	Star22 - direction
	Planet23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 infrared4)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon19)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared4)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared3)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet21)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 spectrograph0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 Star0)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
	(supports instrument8 spectrograph0)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Star14)
	(pointing satellite1 Star5)
	(pointing satellite4 Planet9)
	(have_image Star5 spectrograph1)
	(have_image Planet6 thermograph2)
	(have_image Star7 infrared4)
	(have_image Star8 spectrograph0)
	(have_image Planet9 infrared4)
	(have_image Star10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 infrared4)
	(have_image Phenomenon15 spectrograph1)
	(have_image Star16 thermograph2)
	(have_image Phenomenon17 infrared4)
	(have_image Phenomenon19 infrared4)
	(have_image Planet20 infrared4)
	(have_image Planet21 spectrograph1)
	(have_image Star22 infrared4)
	(have_image Planet23 thermograph2)
	(have_image Phenomenon24 spectrograph0)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 22
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 22
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 22
4. (turn_to satellite4 star1 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 star1)
   goals met: 0 of 22
5. (calibrate satellite4 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 0 of 22
6. (turn_to satellite4 phenomenon12 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 22
7. (take_image satellite4 phenomenon12 instrument8 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 1 of 22
8. (turn_to satellite4 phenomenon13 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon13)
   goals met: 1 of 22
9. (take_image satellite4 phenomenon13 instrument8 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 22
10. (turn_to satellite4 phenomenon15 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon15)
   goals met: 2 of 22
11. (take_image satellite4 phenomenon15 instrument8 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 3 of 22
12. (turn_to satellite4 phenomenon24 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon24)
   goals met: 3 of 22
13. (take_image satellite4 phenomenon24 instrument8 spectrograph0)
   added: (have_image phenomenon24 spectrograph0)
   goals met: 4 of 22
14. (turn_to satellite4 planet21 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 planet21)
   goals met: 4 of 22
15. (take_image satellite4 planet21 instrument8 spectrograph1)
   added: (have_image planet21 spectrograph1)
   goals met: 5 of 22
16. (turn_to satellite4 planet9 planet21)
   deleted: (pointing satellite4 planet21)
   added: (pointing satellite4 planet9)
   goals met: 6 of 22
17. (turn_to satellite3 groundstation2 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 groundstation2)
   goals met: 6 of 22
18. (calibrate satellite3 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 6 of 22
19. (turn_to satellite3 planet23 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet23)
   goals met: 6 of 22
20. (take_image satellite3 planet23 instrument5 thermograph2)
   added: (have_image planet23 thermograph2)
   goals met: 7 of 22
21. (turn_to satellite3 planet6 planet23)
   deleted: (pointing satellite3 planet23)
   added: (pointing satellite3 planet6)
   goals met: 7 of 22
22. (take_image satellite3 planet6 instrument5 thermograph2)
   added: (have_image planet6 thermograph2)
   goals met: 8 of 22
23. (turn_to satellite3 star16 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star16)
   goals met: 8 of 22
24. (take_image satellite3 star16 instrument5 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 9 of 22
25. (turn_to satellite1 star3 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 star3)
   goals met: 9 of 22
26. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 9 of 22
27. (turn_to satellite1 phenomenon17 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon17)
   goals met: 9 of 22
28. (take_image satellite1 phenomenon17 instrument1 infrared4)
   added: (have_image phenomenon17 infrared4)
   goals met: 10 of 22
29. (turn_to satellite1 phenomenon19 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon19)
   goals met: 10 of 22
30. (take_image satellite1 phenomenon19 instrument1 infrared4)
   added: (have_image phenomenon19 infrared4)
   goals met: 11 of 22
31. (turn_to satellite1 planet20 phenomenon19)
   deleted: (pointing satellite1 phenomenon19)
   added: (pointing satellite1 planet20)
   goals met: 11 of 22
32. (take_image satellite1 planet20 instrument1 infrared4)
   added: (have_image planet20 infrared4)
   goals met: 12 of 22
33. (turn_to satellite1 planet9 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 planet9)
   goals met: 12 of 22
34. (take_image satellite1 planet9 instrument1 infrared4)
   added: (have_image planet9 infrared4)
   goals met: 13 of 22
35. (turn_to satellite1 star14 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star14)
   goals met: 13 of 22
36. (take_image satellite1 star14 instrument1 infrared4)
   added: (have_image star14 infrared4)
   goals met: 14 of 22
37. (turn_to satellite1 star22 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star22)
   goals met: 14 of 22
38. (take_image satellite1 star22 instrument1 infrared4)
   added: (have_image star22 infrared4)
   goals met: 15 of 22
39. (turn_to satellite1 star5 star22)
   deleted: (pointing satellite1 star22)
   added: (pointing satellite1 star5)
   goals met: 16 of 22
40. (take_image satellite1 star5 instrument1 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 17 of 22
41. (turn_to satellite0 star14 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star14)
   goals met: 18 of 22
42. (turn_to satellite4 star10 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star10)
   goals met: 17 of 22
43. (take_image satellite4 star10 instrument8 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 18 of 22
44. (turn_to satellite4 planet9 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet9)
   goals met: 19 of 22
45. (turn_to satellite4 star11 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star11)
   goals met: 18 of 22
46. (take_image satellite4 star11 instrument8 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 19 of 22
47. (turn_to satellite4 planet9 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 planet9)
   goals met: 20 of 22
48. (turn_to satellite4 star8 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star8)
   goals met: 19 of 22
49. (take_image satellite4 star8 instrument8 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 20 of 22
50. (turn_to satellite4 planet9 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 planet9)
   goals met: 21 of 22
51. (turn_to satellite1 star7 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star7)
   goals met: 20 of 22
52. (take_image satellite1 star7 instrument1 infrared4)
   added: (have_image star7 infrared4)
   goals met: 21 of 22
53. (turn_to satellite1 star5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star5)
   goals met: 22 of 22
